<a href="https://colab.research.google.com/github/kit1412/basicprojects/blob/pythoncodes/Assignment03_26_09_2020.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Q-1 
a.Create a dictionary from the specified data, and store it into a dataframe in pandas

In [ ]:
import pandas as p
import numpy as np

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}#creating the dictionary


df = p.DataFrame(data = exam_data, index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
#creating a dataframe from the dictionary

a.  Display the entire dataframe

In [ ]:
print("The entire dataframe:")
df
#printing the entire dataframe

The entire dataframe:

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

b. Print the first three rows of the dataframe

In [ ]:
print("\n\nThe first three rows of this dataframe:")
df.iloc[:3]

The first three rows of this dataframe:

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

c. Print only the name and score columns from the dataframe

In [ ]:
print("Printing the names and scores from the dataframe:")
df[['name','score']]

Printing the names and scores from the dataframe:

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

d. Select the rows where the number of attempts in the examination is greater than 2

In [ ]:
n = len(df)

print("The details of students who attempted the examination more than two times:")
df.loc[df['attempts'] > 2]

The details of students who attempted the examination more than two times:

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

e. Change the score in row 'd' to 11.5

In [ ]:
df.iat[3, 1] = 11.5
print("The modified dataframe:")
df
#changing the value

The modified dataframe:

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

f. Change yes and no from the 'qualify' column to True and False

In [ ]:
df.loc[df.qualify == "yes", 'qualify'] = "True"
df.loc[df.qualify == "no", 'qualify'] = "False"
#changing yes and no into True and False respectively

print("The changed dataframe:")
df
#converting to a dataframe

The changed dataframe:

        name  score  attempts qualify
a  Anastasia   12.5         1    True
b       Dima    9.0         3   False
c  Katherine   16.5         2    True
d      James   11.5         3   False
e      Emily    9.0         2   False
f    Michael   20.0         3    True
g    Matthew   14.5         1    True
h      Laura    NaN         1   False
i      Kevin    8.0         2   False
j      Jonas   19.0         1    True

2.	Dictionary data:
	data = {'Name': ['Tom', 'Jack', 'Rachel', 'Ricky'], 'Gender': ['M', 'M', 'F', 'M'] 'Age': [28, 34, 29, 42], 'Address': ['Chennai', 'Ahmadabad', 'Kolkata', 'Kanpur'], 'Qualification': ['M.B.A', 'M.Sc', 'M.Tech', 'M.A']}
	index=['rank1','rank2','rank3','rank4']
a. Append a new row to the data frame with given values for each column.

In [ ]:
d = {'Name': ['Tom', 'Jack', 'Rachel', 'Ricky'], 
        'Gender': ['M', 'M', 'F', 'M'], 
        'Age': [28, 34, 29, 42], 
        'Address': ['Chennai', 'Ahmadabad', 'Kolkata', 'Kanpur'], 
        'Qualification': ['M.B.A', 'M.Sc', 'M.Tech', 'M.A']} 
df = p.DataFrame(data=d, index=['rank1','rank2','rank3','rank4'])
#converting the dictionary into a dataframe

df.loc['rank5'] = ['Ross', 'M', 26, 'Bangalore', 'Btech']
df

         Name Gender  Age    Address Qualification
rank1     Tom      M   28    Chennai         M.B.A
rank2    Jack      M   34  Ahmadabad          M.Sc
rank3  Rachel      F   29    Kolkata        M.Tech
rank4   Ricky      M   42     Kanpur           M.A
rank5    Ross      M   26  Bangalore         Btech

b. Display the 3rd row using index.

In [ ]:
print("The third row =\n", df.iloc[2:3])
#printing the third row, in the format of the row and thus using slicing

The third row =
          Name Gender  Age  Address Qualification
rank3  Rachel      F   29  Kolkata        M.Tech

c. Delete the 'Address' and 'Gender' column together from the DataFrame.

In [ ]:
df.drop(columns = ['Address', 'Gender'])
#deleting both of them together

         Name  Age Qualification
rank1     Tom   28         M.B.A
rank2    Jack   34          M.Sc
rank3  Rachel   29        M.Tech
rank4   Ricky   42           M.A
rank5    Ross   26         Btech

3.	Use the file "test_data.txt", where each row tells at what time two users have communicated. 	The first column tells about the time, second and third column denotes two users.
a. Read the file in pandas DataFrame.

In [ ]:
df = p.read_table('test_data.txt', sep = " ", header = None) 
#reading the data from the test file
df

     0  1  2
0    1  a  b
1    2  a  b
2    5  a  b
3    8  a  b
4    9  a  b
5    2  a  c
6    3  a  c
7    7  a  c
8    9  a  c
9   10  a  c
10   5  a  d
11  10  a  d
12   1  b  c
13   3  b  c
14   6  b  c
15   8  b  c
16   4  b  d
17   5  b  d
18   7  b  d
19   9  b  d
20   1  c  d
21   2  c  d
22   4  c  d
23   6  c  d
24   5  c  e
25   6  c  e
26   3  d  e
27   5  d  e
28   9  d  e

b. Add column names.

In [ ]:
df.columns = ['Time', 'User 1', 'User 2']
#giving a header to each column
df

    Time User 1 User 2
0      1      a      b
1      2      a      b
2      5      a      b
3      8      a      b
4      9      a      b
5      2      a      c
6      3      a      c
7      7      a      c
8      9      a      c
9     10      a      c
10     5      a      d
11    10      a      d
12     1      b      c
13     3      b      c
14     6      b      c
15     8      b      c
16     4      b      d
17     5      b      d
18     7      b      d
19     9      b      d
20     1      c      d
21     2      c      d
22     4      c      d
23     6      c      d
24     5      c      e
25     6      c      e
26     3      d      e
27     5      d      e
28     9      d      e

c. Using describe function determine the mean, mode and standard deviation of the total time period.

In [ ]:
stats = df['Time'].describe()

#print(stats)

print("The mean of the data is :", stats.iloc[1])
print("The standard deviation :", stats.iloc[2])

mode = df['Time'].mode()
print("The mode of the given data :", mode[0])

#finding and displaying the mode, which cannot be obtained from describe() function

The mean of the data is : 5.344827586206897
The standard deviation : 2.85701970177923
The mode of the given data : 5

d. Determine the total time period of communication of each user. Create a new grouped DataFrame based on the time period of communication of each user.

In [ ]:
sum = df.groupby(['User 1',  'User 2'], as_index=False)
#to store the number of times each has talked

print("New dataframe based on the time period of communication of each pair of users:")

gdf = sum.aggregate(np.sum)
gdf
#creating the new dataframe and printing it, if we are considering the time period of communication

New dataframe based on the time period of communication of each pair of users:

  User 1 User 2  Time
0      a      b    25
1      a      c    31
2      a      d    15
3      b      c    18
4      b      d    25
5      c      d    13
6      c      e    11
7      d      e    17

If we are considering the total time each individual has spent talking to someone, whoever it may be

In [ ]:
sum1 = df.groupby(['User 1'])['Time'].sum()
sum2 = df.groupby(['User 2'])['Time'].sum()

sum3 = sum1.add(sum2, fill_value = 0)
#adding the time from both columns

df1 = p.DataFrame(sum3, ['a', 'b', 'c', 'd', 'e'])
df1 = df1.astype(int)
df1

   Time
a    71
b    68
c    73
d    70
e    28